app/controllers/proteins_controller.rb

SELECT "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "msresults".* FROM "msresults" WHERE (material_id =3 AND gel_no=1)
---
	def list_protein
		#@material			=		Material.where(material_id:3)
		#@material			=		Material.where(material_id: params[:material_id])
		@material			=		Material.find(params[:material_id])
		#@material			=		Material.find_by(params[:material_id])
		@list_protein		=		Msresult.where('material_id =:material_id AND gel_no=1',:material_id =>params[:material_id].to_i)

SELECT "materialweights".* FROM "materialweights" WHERE "materialweights"."material_id" = $1  [["material_id", 3]]
---
def getchartlist
		@gel_no			=	params[:gel_no]
		#list
		getlist(params[:main_gene_id],@gel_no,params[:material_id])

		#charts
		makeCharts(params[:main_gene_id],params[:gene_id],params[:gene_id_str],params[:material_id],params[:mode],1,1)


		#header
		setheader(params[:main_gene_id],params[:material_id],params[:mode])

		#weight
		#@weights 		=   Materialweight.find_all_by_material_id(params[:material_id].to_i)
		@weights 		=   Materialweight.where(material_id: params[:material_id].to_i)

SELECT "msresults".* FROM "msresults" WHERE (gel_no ='38' AND empai >0 AND material_id =3) ORDER BY empai DESC
---
			chartset					=	Chartset.new
			chartset.gene_id		=	key

      @results		   =	Msresult.where(material_id: w_material_id.to_i, gene_id:key)

SELECT "proteins".* FROM "proteins" WHERE "proteins"."gene_id" = $1 LIMIT $2  [["gene_id", "AT1G01090"], ["LIMIT", 1]]
SELECT "materials".* FROM "materials" WHERE "materials"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def	setheader(w_main_gene_id,w_material_id,w_mode)
		#header
		@main_gene_id		=	w_main_gene_id
		@protein				=	Protein.find_by_gene_id(w_main_gene_id)
		@material				=	Material.find(w_material_id)