app/views/proteins/getchartslist.html.erb

SELECT "materialweights".* FROM "materialweights" WHERE "materialweights"."material_id" = $1  [["material_id", 3]]
---
					<td class="colm_name">gel_no<td>
						<% @material.materialweights.each do |weight| %>